Enterprise_Serivces/Cert/SilverGroup2/StoreInformation-HopsService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/storeinformation/contracts/2011/02/IHopsService/UpdateHopsConfigurationForStore</wsa:Action><wsa:MessageID>uuid:ec67fb63-d9fe-4e9d-90ef-e7ad17da4c35</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslstoreinformationserviceqa1.testgs.pvt/HopsService.svc</wsa:To></soap:Header><soap:Body><UpdateHopsConfigurationForStore xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/2011/02"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CountryCode xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/messages/2011/02">US</CountryCode><HopsConfiguration xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/messages/2011/02"><ExpireExtensionDuration xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/entities/2011/02">180000</ExpireExtensionDuration><HopsEnabled xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/entities/2011/02">true</HopsEnabled><IsStoreOpen xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/entities/2011/02">true</IsStoreOpen><PickupExpirationDuration xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/entities/2011/02">48</PickupExpirationDuration><RequestWarningThreshold xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/entities/2011/02">3</RequestWarningThreshold><ServerPollingPeriod xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/entities/2011/02">180000</ServerPollingPeriod></HopsConfiguration><StoreNumber xmlns="http://www.gamestop.com/services/csl/storeinformation/contracts/messages/2011/02">16</StoreNumber></request></UpdateHopsConfigurationForStore></soap:Body></soap:Envelope>